---
kind: type
id: T:Autodesk.Revit.UI.PushButton
zh: 按钮
source: html/c4294178-9b46-3590-98b1-970af89e3c10.htm
---
# Autodesk.Revit.UI.PushButton

**中文**: 按钮

The PushButton object represents an button on a RibbonPanel.

## Syntax (C#)
```csharp
public class PushButton : RibbonButton
```

## Remarks
Use of this class is not supported in Revit Macros.